run/steady-coarse/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];
internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    inlet   { type calculated; value uniform 0; }
    outlet  { type calculated; value uniform 0; }
    ground  { type nutUSpaldingWallFunction; value uniform 0; }
    top     { type slip; }
    sides   { type slip; }
    kitten  { type nutUSpaldingWallFunction; value uniform 0; }
}


// ************************************************************************* //
